Ebkosha/gr/system/StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.cpp
  /* Determine request type */
  requestType = (USB_RequestType_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_REQUEST_TYPE_Msk);
  requestDirection = (USB_RequestTypeDT_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_REQUEST_DT_Msk);

  /* Process request */
  switch (requestType)
  {
    /* Standard request */
    case USB_TYPE_STANDARD: {
      USB_RequestRecipient_TypeDef recipient;
      USB_EP_IO_Handler statusAckHandler = 0;

      wValue = USB_SetupPacket->wValue;
      wIndex = USB_SetupPacket->wIndex;
      wLength = USB_SetupPacket->wLength;

      /* Recipient check */
      recipient = (USB_RequestRecipient_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_RECIPIENT_TYPE_Msk);
      if (!IS_VALID_USB_RECIPIENT(recipient)) {
        result = USB_ERR_INV_REQ;
        break;
      }
      /* Specific requests */
      switch (USB_SetupPacket->bRequest)
      {
        /* GET_STATUS */
        case USB_GET_STATUS:
          if (requestDirection != USB_DEVICE_TO_HOST ||
             (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
              (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints))))
          {
            result = USB_ERROR;
          }
          else
          {
            /* Give user a chance to set flags in the device context */
            result = USB_DEVICE_HANDLE_GET_STATUS(recipient, wIndex);
            if (result == USB_SUCCESS)
            {
              switch (recipient)
              {
                /* Device - return Self Powered and Remote Wakeup status */
                case USB_RECIPIENT_DEVICE:
                  SetupPacketData[0] = 0
#ifdef USB_SELF_POWERED_SUPPORTED
                    | USB_DeviceContext.USB_DeviceStatus.SelfPowered
#endif /* USB_SELF_POWERED_SUPPORTED */
#ifdef USB_REMOTE_WAKEUP_SUPPORTED
                    | (USB_DeviceContext.USB_DeviceStatus.RemoteWakeupEnabled << 1)
#endif /* USB_REMOTE_WAKEUP_SUPPORTED */
                    ;
                  break;
                /* Interface - return 0 */
                case USB_RECIPIENT_INTERFACE:
                  SetupPacketData[0] = 0;
                  break;
                /* Endpoint - return Halt status */
                case USB_RECIPIENT_ENDPOINT:
                  SetupPacketData[0] = USB_EPContext[wIndex].EP_Halt;
                  break;
                default:
                  break;
              }
              SetupPacketData[1] = 0;
              result = USB_EP_doDataIn(EPx, SetupPacketData, 2, USB_DeviceDoStatusOutAck);
            }
          }
          break;
        /* CLEAR_FEATURE */
        case USB_CLEAR_FEATURE:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
              (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints)))
          {
            result = USB_ERROR;
          }
          else
          {
            result = USB_DEVICE_HANDLE_CLEAR_FEATURE(recipient, wValue, wIndex);
          }
          break;
        /* SET_FEATURE */
        case USB_SET_FEATURE:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
              (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints)))
          {
            result = USB_ERROR;
          }
          else
          {
            result = USB_DEVICE_HANDLE_SET_FEATURE(recipient, wValue, wIndex);
          }
          break;
        /* SET_ADDRESS */
        case USB_SET_ADDRESS:
          result = USB_DEVICE_HANDLE_SET_ADDRESS(wValue);
          /* Set special Status Stage handler that will actually change the address */
          USB_DeviceContext.Address = wValue;
          statusAckHandler = USB_Device_setAddressWork;
          break;
        /* GET_DESCRIPTOR */
        case USB_GET_DESCRIPTOR:
          result = USB_DEVICE_HANDLE_GET_DESCRIPTOR(wValue, wIndex, wLength);
          break;
        /* SET_DESCRIPTOR */
        case USB_SET_DESCRIPTOR:
          result = USB_DEVICE_HANDLE_SET_DESCRIPTOR(wValue, wIndex, wLength);
          break;
        /* GET_CONFIGURATION */
        case USB_GET_CONFIGURATION:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
          {
            SetupPacketData[0] = 0;
          }
          else
          {
            SetupPacketData[0] = (uint8_t)USB_DEVICE_HANDLE_GET_CONFIGURATION;
          }
          result = USB_EP_doDataIn(EPx, SetupPacketData, 1, USB_DeviceDoStatusOutAck);
          break;
        /* SET_CONFIGURATION */
        case USB_SET_CONFIGURATION:
          if (wValue == 0)
          {
            USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_ADDRESS;
          }
          else
          {
            result = USB_DEVICE_HANDLE_SET_CONFIGURATION(wValue);
            if (result == USB_SUCCESS)
            {
              USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_CONFIGURED;
            }
          }
          break;
        /* GET_INTERFACE */
        case USB_GET_INTERFACE:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
          {
            result = USB_ERROR;
          }
          else
          {
            SetupPacketData[0] = (uint8_t)USB_DEVICE_HANDLE_GET_INTERFACE(wIndex);
            result = USB_EP_doDataIn(EPx, SetupPacketData, 1, USB_DeviceDoStatusOutAck);
          }
          break;
        /* SET_INTERFACE */
        case USB_SET_INTERFACE:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
          {
            result = USB_ERROR;
          }
          else
          {
            result = USB_DEVICE_HANDLE_SET_INTERFACE(wValue, wIndex);
          }
          break;
        /* SYNCH_FRAME */
        case USB_SYNCH_FRAME:
          if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
          {
            result = USB_ERROR;
          }
          else
          {
            result = USB_DEVICE_HANDLE_SYNC_FRAME(wIndex, SetupPacketData);
            if (result == USB_SUCCESS)
            {
              result = USB_EP_doDataIn(EPx, SetupPacketData, 2, USB_DeviceDoStatusOutAck);
            }
          }
          break;
        default:
          result = USB_ERR_INV_REQ;
      }
      /* If there were no DATA stage, initiate Status Stage (IN ACK) */
      if (result == USB_SUCCESS && wLength == 0)
      {
        result = (USB_SetupPacket->mRequestTypeData & 0x80) == USB_DEVICE_TO_HOST ?
                        USB_EP_doDataOut(EPx, 0, 0, statusAckHandler) :
                        USB_EP_doDataIn(EPx, 0, 0, statusAckHandler);
      }
      break;
    }
    /* Class-specific request */
    case USB_TYPE_CLASS:
      result = USB_DEVICE_HANDLE_CLASS_REQUEST;
      break;
    /* Vendor-specific request */
    case USB_TYPE_VENDOR:
      result = USB_DEVICE_HANDLE_VENDOR_REQUEST;
      break;
    default:
      result = USB_ERR_INV_REQ;
  }
  return result;
}

